---
kind: property
id: P:Autodesk.Revit.DB.ConnectorElement.Domain
source: html/1312512f-c408-f59f-09ed-6c3080b2705d.htm
---
# Autodesk.Revit.DB.ConnectorElement.Domain Property

The domain of the connector.

## Syntax (C#)
```csharp
public virtual Domain Domain { get; }
```

## Remarks
This property is used to retrieve the domain of the connector.